In [2]:
#project 5
import pandas as pd
import os
import sqlite3

In [5]:
titantic= pd.read_csv('~/test.csv')

Survival 0 1
pClass   passenger class
name
sex
age
sibsp   number of siblings/spouses aboard
parch   number of parents/children aboard
ticket  ticket number
fare    passenger fare
cabin   cabin
embarked  point of embarkation  (C=Cherbourg, Q Queenstown, S Southampton

In [8]:
titantic['SibSp'].describe()

count    891.000000
mean       0.523008
std        1.102743
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

In [9]:
titantic['SibSp'].sum()

466

In [10]:
titantic.tail(5)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q